# Pandas

In [1]:
import pandas as pd

In [2]:
student_dict = {'Name': ['Joe', 'Nat'], 'Age': [20, 21], 'Marks': [85.10, 77.80]}

In [61]:
df=pd.DataFrame(student_dict)
df.head()

df.describe

<bound method NDFrame.describe of   Name  Age  Marks
0  Joe   20   85.1
1  Nat   21   77.8>

In [ ]:
a=pd.read_csv('test')

In [ ]:
df.info()

In [52]:
df=pd.DataFrame(student_dict)
df.at[0,'Name']

'Joe'

In [50]:
df

  Name  Age  Marks
0  Joe   20   85.1
1  Nat   21   77.8

In [21]:
df.at[1,'Age']
df.iat[1,1]

21

In [22]:
df.get('Name')

0    Joe
1    Nat
Name: Name, dtype: object

In [24]:
df.loc[0:2,['Name']]
df.iloc[0:2,0:2]

  Name  Age
0  Joe   20
1  Nat   21

In [34]:
df.insert(loc=0, column='test0', value=22)
df

TypeError: insert() got an unexpected keyword argument 'iloc'

In [35]:
df

   test0 Name  test  Age  Marks
0     22  Joe    22   20   85.1
1     22  Nat    22   21   77.8

In [48]:
df

In [37]:
df.loc[len(df)]=[22,'t',22,22,44.4]

In [38]:
df

   test0 Name  test  Age  Marks
0     22  Joe    22   20   85.1
1     22  Nat    22   21   77.8
2     22    t    22   22   44.4

In [ ]:
df=df.drop(columns='test0')

In [63]:
filte=(df['Age']>20)
df=df['Age'].where(filte,inplace=True)
df

In [65]:
df=pd.DataFrame(student_dict)
df.head()

df.describe

<bound method NDFrame.describe of   Name  Age  Marks
0  Joe   20   85.1
1  Nat   21   77.8>

In [73]:
df.filter(like='e',axis='columns')

Empty DataFrame
Columns: [Name, Age, Marks]
Index: []

In [66]:
df

  Name  Age  Marks
0  Joe   20   85.1
1  Nat   21   77.8

In [80]:
df=df.rename(columns={'12':'Namee'})
df

  Namee  Age  Marks
0   Joe   20   85.1
1   Nat   21   77.8

In [ ]:
df2={'ID':[1,2]}

df=df.join(df2)
df

In [92]:
for i,j in df.iterrows():
    print(j)

Namee     Joe
Age        20
Marks    85.1
Name: 0, dtype: object
Namee     Nat
Age        21
Marks    77.8
Name: 1, dtype: object

In [ ]:
df.sort_values(b['Age'])